{"format": "graph-model", "generatedBy": "2.15.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}, {"size": "6"}]}}}, "outputs": {"dense_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "7"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/Read/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/Read_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/Read_2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/Read/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/Read_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/Read_2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_2/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_2/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "7"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "10"}, {"size": "6"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/enter/_117", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm_1/Read/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bV8xL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/enter/_118", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm_1/Read_1/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bV8xL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/enter/_119", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm_1/Read_2/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bV8xL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/enter/_111", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/time"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bV8xL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_57", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm/Read/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_58", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm/Read_1/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_59", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm/Read_2/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_51", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/time"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_49", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_counter"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/enter/_109", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/loop_counter"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bV8xL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/model/lstm/Shape", "op": "Shape", "input": ["input_1"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/transpose", "op": "Transpose", "input": ["input_1", "StatefulPartitionedCall/model/lstm/PartitionedCall/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/enter/_112", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/TensorArrayV2_1"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bV8xL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/merge/_128", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/enter/_117", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/next_iteration/_164"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/merge/_129", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/enter/_118", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/next_iteration/_165"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/merge/_130", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/enter/_119", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/next_iteration/_166"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/merge/_122", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/enter/_111", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/next_iteration/_158"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_68", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_57", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_104"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_69", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_58", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_105"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_70", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_59", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_106"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_62", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_51", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_98"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_60", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_49", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_96"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/merge/_120", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/enter/_109", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/next_iteration/_156"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/lstm/Shape", "StatefulPartitionedCall/model/lstm/strided_slice/stack", "StatefulPartitionedCall/model/lstm/strided_slice/stack_1", "StatefulPartitionedCall/model/lstm/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/transpose", "StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/merge/_123", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/enter/_112", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/next_iteration/_159"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/model/lstm/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/model/lstm/strided_slice", "StatefulPartitionedCall/model/lstm/zeros_1/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/model/lstm/strided_slice", "StatefulPartitionedCall/model/lstm/zeros/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_56", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/Shape", "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice/stack", "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/lstm/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/model/lstm/zeros_1/packed", "StatefulPartitionedCall/model/lstm/zeros_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/model/lstm/zeros/packed", "StatefulPartitionedCall/model/lstm/zeros/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_67", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_56", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_103"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_55", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_54", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm/zeros_1"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_53", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm/zeros"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_52", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2_1"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_66", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_55", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_102"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_65", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_54", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_101"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_64", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_53", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_100"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_63", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_52", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_99"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/cond/_47/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_62", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_66", "^StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_60"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/LoopCond/_71", "op": "LoopCond", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/cond/_47/while/Less"]}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm/PartitionedCall/input/_27_switch/_77", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_65", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/LoopCond/_71"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_79", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_67", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/LoopCond/_71"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm/PartitionedCall/input/_28_switch/_80", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_68", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/LoopCond/_71"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm/PartitionedCall/input/_26_switch/_76", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_64", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/LoopCond/_71"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm/PartitionedCall/input/_29_switch/_81", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_69", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/LoopCond/_71"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm/PartitionedCall/input/_30_switch/_82", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_70", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/LoopCond/_71"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/StatefulPartitionedCall/model/lstm/PartitionedCall/time_switch/_74", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_62", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/LoopCond/_71"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_counter_switch/_72", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_60", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/LoopCond/_71"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2_1_switch/_75", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_63", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/LoopCond/_71"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice_switch/_78", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_66", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/LoopCond/_71"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_83", "op": "Identity", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_counter_switch/_72:1"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/exit/_87", "op": "Exit", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2_1_switch/_75"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_48/while/split/split_dim", "op": "Const", "input": ["^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_83"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_103", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_79:1", "^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_83"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_48/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "input": ["^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_83"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_104", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm/PartitionedCall/input/_28_switch/_80:1", "^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_83"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_105", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm/PartitionedCall/input/_29_switch/_81:1", "^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_83"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_48/while/MatMul_1", "op": "MatMul", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm/PartitionedCall/input/_26_switch/_76:1", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm/PartitionedCall/input/_29_switch/_81:1", "^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_83"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "grad_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_106", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm/PartitionedCall/input/_30_switch/_82:1", "^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_83"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_48/input/_183", "op": "Identity", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/StatefulPartitionedCall/model/lstm/PartitionedCall/time_switch/_74:1", "^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_83"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_48/while/add_2/y", "op": "Const", "input": ["^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_83"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_48/while/add_3/y", "op": "Const", "input": ["^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_83"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_102", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice_switch/_78:1", "^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_83"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/exit/_87", "StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"num_elements": {"i": "-1"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_48/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_79:1", "Func/StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_48/input/_183", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_48/while/TensorArrayV2Read/TensorListGetItem/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_48/while/add_2", "op": "AddV2", "input": ["Func/StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_48/input/_183", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_48/while/add_2/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_48/while/add_3", "op": "AddV2", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_counter_switch/_72:1", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_48/while/add_3/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/model/lstm/PartitionedCall/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_48/while/add", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_48/while/TensorArrayV2Read/TensorListGetItem", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm/PartitionedCall/input/_28_switch/_80:1", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_48/while/MatMul_1"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_98", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_48/while/add_2", "^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_83"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_96", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_48/while/add_3", "^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_83"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/transpose_1", "StatefulPartitionedCall/model/batch_normalization/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_48/while/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_48/while/add", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm/PartitionedCall/input/_30_switch/_82:1"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/model/batch_normalization/batchnorm/mul_1", "StatefulPartitionedCall/model/batch_normalization/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_48/while/split", "op": "Split", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_48/while/split/split_dim", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_48/while/BiasAdd"], "attr": {"num_split": {"i": "4"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model/batch_normalization/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/model/batch_normalization/batchnorm/add_1", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_48/while/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_48/while/split"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_48/while/Sigmoid_1", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_48/while/split:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_48/while/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_48/while/split:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_48/while/Sigmoid_2", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_48/while/split:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/lstm_1/Shape", "StatefulPartitionedCall/model/lstm_1/strided_slice/stack", "StatefulPartitionedCall/model/lstm_1/strided_slice/stack_1", "StatefulPartitionedCall/model/lstm_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/transpose", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_48/while/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_48/while/Sigmoid_1", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm/PartitionedCall/input/_27_switch/_77:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_48/while/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_48/while/Sigmoid", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_48/while/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/model/lstm_1/strided_slice", "StatefulPartitionedCall/model/lstm_1/zeros_1/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/model/lstm_1/strided_slice", "StatefulPartitionedCall/model/lstm_1/zeros/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/enter/_116", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bV8xL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/Shape", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/strided_slice/stack", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_48/while/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_48/while/mul", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_48/while/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/model/lstm_1/zeros_1/packed", "StatefulPartitionedCall/model/lstm_1/zeros_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/model/lstm_1/zeros/packed", "StatefulPartitionedCall/model/lstm_1/zeros/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/merge/_127", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/enter/_116", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/next_iteration/_163"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/enter/_115", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/strided_slice"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bV8xL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_48/while/Tanh_1", "op": "Tanh", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_48/while/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_101", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_48/while/add_1", "^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_83"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/enter/_114", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm_1/zeros_1"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bV8xL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/enter/_113", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm_1/zeros"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bV8xL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/merge/_126", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/enter/_115", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/next_iteration/_162"], "attr": 